In [2]:
import pandas as pd

In [4]:
df = pd.read_csv('emp.csv')
print(df)

                 Name Hire Date   Salary  Leaves Remaining
0           John Idle  08/15/14  50000.0                  10
1       Smith Gilliam  04/07/15  65000.0                   6
2      Parker Chapman  02/21/14  45000.0                   7
3         Jones Palin  10/14/13  70000.0                   3
4       Terry Gilliam  07/22/14  48000.0                   9
5       Michael Palin  06/28/13  66000.0                   8

In [6]:
js = pd.read_json('customer.json')
print(js)

                                      _id  user_id      firstName  \
0    {'$oid': '60ceca5619aede5ad4fc588d'}        1          rohit
1    {'$oid': '60ced2501ae3bf6edac5e659'}        2          rohit
2    {'$oid': '60ced2d0232579a95e0a46dd'}        3          rohit
3    {'$oid': '60cf12ca967b8c2cbaa76b41'}        4           amit
4    {'$oid': '60cf133365c1c8f6e0d2f8eb'}        5        kamlesh
..                                    ...      ...            ...
501  {'$oid': '60db3b7c7e01942eee89f691'}      503  kausal kumar
502  {'$oid': '60db3b7c7e01942eee89f692'}      504  kausal kumar
503  {'$oid': '60db3b7c7e01942eee89f693'}      505         rohit
504  {'$oid': '60de96fbb9738f1318ff61a4'}      506        parmar
505  {'$oid': '60de992d1eb4acef38a70b85'}      507        parmar

           lastName gender  age         education  salary maritalstatus  \
0          himanshu   male   21            master   70000     unmarried
1             kiran   male   22          graduate   70000     unmarried
2        devtanbhai   male   50          graduate   90000       married
3            parmar   male   35           gaduate   23000       married
4            parmar   male   32               hsc   22000       married
..              ...    ...  ...               ...     ...           ...
501        Krishna    male   33  higher secondary   37000     unmarried
502  Krishnamurthy    male   34  higher secondary   15000     unmarried
503       Krishnan    male   35  higher secondary   16000     unmarried
504            Kunj   male   36  higher secondary   59000     unmarried
505            Kunj   male   36  higher secondary   59000     unmarried

    country       city
0     india  ahmedabad
1     india  ahmedabad
2     india  ahmedabad
3     india    mahudha
4     india    kathlal
..      ...        ...
501  africa     lusaka
502  africa     lusaka
503  africa     lusaka
504  africa     lusaka
505  africa     lusaka

[506 rows x 11 columns]

In [10]:
import sqlite3 as sq

In [15]:
con = sq.connect('database.db')

In [16]:
sdf = pd.read_sql_query("SELECT * FROM information", con)

DatabaseError: Execution failed on sql 'SELECT * FROM information': no such table: information